const cl = require("./console-log");

//Выведите столбец чисел от 1 до 100.
for (let i = 1; i <= 100; i += 1) {
  cl(i);
}
let i = 1;
while (i <= 100) {
  cl(i), (i += 1);
}

// Выведите столбец чисел от 11 до 33.
for (let i = 11; i <= 33; i += 1) {
  cl(i);
}
i = 11;
while (i <= 33) {
  cl(i), (i += 1);
}

// Выведите столбец четных чисел в промежутке от 0 до 100.
for (let i = 2; i <= 100; i += 2) {
  cl(i);
}

i = 1;
while (i <= 100) {
  if (i % 2 == 0) {
    cl(i);
  }
  i += 1;
}
//С помощью цикла найдите сумму чисел от 1 до 100.
let sum = 0;
for (let i = 1; i <= 100; i++) {
  sum = sum + i;
}
